[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequest-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
       </Row>
 
killedBy: RecommendationRequest tests renders correctly when passing in a RecommendationRequest
statusReason: Error: Unable to find an element by: [data-testid="/RecommendationRequest-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:34:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequest-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
       </Row>
 
killedBy: RecommendationRequest tests renders correctly when passing in a RecommendationRequest
statusReason: Error: Unable to find an element by: [data-testid="/RecommendationRequest-id/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
