[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestCreatePage.js:21:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `New Recommendation Request Created - id: ${recommendationRequest.id} name: ${recommendationRequest.name}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Recommendation Request Created - id: 10 name: undefined"

Number of calls: 0
