[Killed] ArrayDeclaration
main/components/HelpRequest/HelpRequestTable.js:36:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "ID",
-      accessor: "id", // accessor is the "key" in the data
-    },
-    {
-      Header: "Requester Email",
-      accessor: "requesterEmail",
-    },
-    {
-      Header: "Team ID",
-      accessor: "teamId",
-    },
-    {
-      Header: "Description",
-      accessor: "description",
-    },
-    // Add more columns as needed
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:39:17
   const columns = [
     {
       Header: "ID",
-      accessor: "id", // accessor is the "key" in the data
+      accessor: "", // accessor is the "key" in the data
     },
     {
killedBy: HelpRequestIndexPage tests renders three help requests correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
