[Killed] ArrowFunction
main/pages/HelpRequest/HelpRequestCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequest/post", // Ensure this matches the POST endpoint in Swagger
-    method: "POST",
-    data: {
-      // Use 'data' instead of 'params'
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom, // Add missing fields
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:8:49
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequest/post", // Ensure this matches the POST endpoint in Swagger
-    method: "POST",
-    data: {
-      // Use 'data' instead of 'params'
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom, // Add missing fields
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = (helpRequest) => ({});
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestCreatePage.js:10:13
 export default function HelpRequestCreatePage({ storybook = false }) {
   const objectToAxiosParams = (helpRequest) => ({
     url: "/api/helprequest/post", // Ensure this matches the POST endpoint in Swagger
-    method: "POST",
+    method: "",
     data: {
       // Use 'data' instead of 'params'
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestCreatePage.js:41:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/helprequest" />; // Corrected redirect path
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequest
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/helprequest"}

Number of calls: 0
