[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.js:44:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `Help Request Updated - id: ${helpRequest.id} by: ${helpRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/HelpRequest/HelpRequestEditPage.js:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Help Request</h1>
-        {helpRequest && (
-          <HelpRequestForm
-            submitAction={onSubmit}
-            // Stryker disable next-line all: button label is constant
-            buttonLabel={"Update"}
-            initialContents={helpRequest}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/HelpRequest/HelpRequestEditPage.js:71:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Help Request</h1>
-        {helpRequest && (
-          <HelpRequestForm
-            submitAction={onSubmit}
-            // Stryker disable next-line all: button label is constant
-            buttonLabel={"Update"}
-            initialContents={helpRequest}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
