[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:22:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="id">Id</Form.Label>
-          <Form.Control
-            data-testid={`${testIdPrefix}-id`}
-            id="id"
-            type="text"
-            {...register("id")}
-            value={initialContents.id}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: HelpRequestForm tests renders disabled id field when initialContents is provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:56:24
       <Form.Group className="mb-3">
         <Form.Label htmlFor="teamId">Team ID</Form.Label>
         <Form.Control
-          data-testid={`${testIdPrefix}-teamId`}
+          data-testid={``}
           id="teamId"
           type="text"
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestForm-teamId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:92:24
       <Form.Group className="mb-3">
         <Form.Label htmlFor="requestTime">Request Time</Form.Label>
         <Form.Control
-          data-testid={`${testIdPrefix}-requestTime`}
+          data-testid={``}
           id="requestTime"
           type="datetime-local"
killedBy: HelpRequestForm tests submits form successfully with valid inputs
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestForm-requestTime"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:129:24
 
       <Form.Group className="mb-3">
         <Form.Check
-          data-testid={`${testIdPrefix}-solved`}
+          data-testid={``}
           id="solved"
           label="Solved"
killedBy: HelpRequestForm tests toggles Solved checkbox
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestForm-solved"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
