[Killed] ArrowFunction
main/components/UCSBOrganization/UCSBOrganizationTable.js:50:13
       Header: "Inactive",
       accessor: "inactive",
 
-      Cell: ({ value }) => (value ? "True" : "False"),
+      Cell: () => undefined,
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  False
Received:

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:50:37
       Header: "Inactive",
       accessor: "inactive",
 
-      Cell: ({ value }) => (value ? "True" : "False"),
+      Cell: ({ value }) => (value ? "" : "False"),
     },
   ];
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  True
Received:

[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:54:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "OrganizationTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "OrganizationTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="OrganizationTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:56:53
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "OrganizationTable"),
+      ButtonColumn("Edit", "primary", editCallback, ""),
     );
     columns.push(
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="OrganizationTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:56:20
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "OrganizationTable"),
+      ButtonColumn("", "primary", editCallback, "OrganizationTable"),
     );
     columns.push(
killedBy: UCSBOrganizationTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:59:30
       ButtonColumn("Edit", "primary", editCallback, "OrganizationTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "OrganizationTable"),
+      ButtonColumn("Delete", "", deleteCallback, "OrganizationTable"),
     );
   }
killedBy: UCSBOrganizationTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
