[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:22:15
       // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/ucsborganizations`,
-      params: { orgCode: id }, // Ensure orgCode is passed here in params
+      params: {}, // Ensure orgCode is passed here in params
     },
   );
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:40:43
     },
   });
 
-  const onSuccess = (ucsbOrganization) => {
-    toast(`UCSB Organization Updated - orgCode: ${ucsbOrganization.orgCode}`);
-  };
+  const onSuccess = (ucsbOrganization) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />
