[Killed] OptionalChaining
main/components/UCSBOrganization/UCSBOrganizationForm.js:32:29
           {...register("orgCode", {
             required: "Organization Code is required.",
           })}
-          disabled={Boolean(initialContents?.orgCode)}
+          disabled={Boolean(initialContents.orgCode)}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'orgCode')
